app/User.php

    public function getMeta($key, $default = '')
    {
        $val = DB::table('user_meta')->where([
            'user_id' => $this->id,
            'name' => $key
        ])->first();
---
select * from `user_meta` where (`user_id` = 16 and `name` = 'social_meta_avatar') limit 1

    public function getWishlistCountAttribute()
    {
        if ($this->hasPermission('candidate_manage')) {
            return UserWishList::query()->where('user_id', $this->id)->where('object_model', 'job')->count('id');
---
select count(`id`) as aggregate from `user_wishlist` where `user_id` = 16 and `object_model` = 'job'