modules/User/Controllers/UserWishListController.php

    public function followingEmployers(Request $request){
        $wishlist = $this->userWishListClass::query();
        if($s = $request->get('s')){
            $wishlist = $wishlist->whereHas('company', function ($q) use ($s) {
                $q->where('name', 'like', '%'.$s.'%');
            });
        }
        $wishlist = $wishlist->where('object_model', 'company')
            ->where("user_wishlist.user_id",Auth::id())
            ->orderBy('user_wishlist.id', 'desc');
        $data = [
            'rows' => $wishlist->paginate(10),
            'page_title'         => __("Following Employers"),
            'menu_active' => 'user_profile',
        ];
---
select count(*) as aggregate from `user_wishlist` where `object_model` = 'company' and `user_wishlist`.`user_id` = 16