modules/Candidate/Controllers/ManageCandidateController.php

    public function cvManager(Request $request){

        $rows = CandidateCvs::with('media')
            ->where('origin_id', Auth::id())
            ->get();
---
select * from `bc_candidate_cvs` where `origin_id` = 16