modules/Candidate/Controllers/ProfileController.php

select * from `bc_candidates` where `bc_candidates`.`id` = 16 and `bc_candidates`.`id` is not null and `bc_candidates`.`deleted_at` is null limit 1
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null
select * from `bc_categories` where `bc_categories`.`deleted_at` is null
select * from `bc_skills` where `status` = 'publish' and `bc_skills`.`deleted_at` is null
select * from `bc_candidate_cvs` where `origin_id` = 16
---
    public function index()
    {
        if (!is_candidate()) abort(403);

        $user = auth()->user();

        $data = [
            'row' => $user->candidate ?? $this->candidate,
            'page_title' => __("Candidate Profile"),
            'user' => $user,
            'is_user_page'     => true,
            'locations' => Location::query()->where('status', 'publish')->get()->toTree(),
            'categories' => Category::get()->toTree(),
            'skills' => Skill::query()->where('status', 'publish')->get(),
            'cvs'   => CandidateCvs::query()->where('origin_id', $user->id)->with('media')->get(),
            'rows'   => CandidateCvs::query()->where('origin_id', $user->id)->with('media')->get(),
            'menu_active' => 'user_profile',
            'languages' => config('languages.locales')
        ];